---
title: GeomCombinationSet
classe: Autodesk.Revit.DB.GeomCombinationSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# GeomCombinationSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `geomCombinationSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `geomCombinationSet.Size` | Int32 |
| `Void Clear()` | `geomCombinationSet.Clear()` | Void |
| `Boolean Contains(GeomCombination)` | `geomCombinationSet.Contains(item)` | Boolean |
| `Int32 Erase(GeomCombination)` | `geomCombinationSet.Erase(item)` | Int32 |
| `GeomCombinationSetIterator ForwardIterator()` | `geomCombinationSet.ForwardIterator()` | GeomCombinationSetIterator |
| `IEnumerator GetEnumerator()` | `geomCombinationSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(GeomCombination)` | `geomCombinationSet.Insert(item)` | Boolean |
| `GeomCombinationSetIterator ReverseIterator()` | `geomCombinationSet.ReverseIterator()` | GeomCombinationSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```